Tekla Open API Reference for Tekla Structures 2025
GeometryConstants.SCALAR_EPSILON Field
 The minimum value used for comparing floating point scalar values. Any smaller difference will be considered equivalent to 0.0.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const double SCALAR_EPSILON = 1E-13
Public Const SCALAR_EPSILON As Double = 1E-13
Field Value
Type: Double
See Also
Reference
GeometryConstants Class
Tekla.Structures.Geometry3d Namespace